InformationRegisters/LN_МСРОчередьСэмплинга.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>LN_МСРОчередьСэмплинга</Name>
			<Comment>Очередь запросов sampling/createMessage. Сервер кладёт запрос на сэмплинг (pending), клиент-агент опрашивает pull_pending_sampling, выполняет LLM-вызов и возвращает submit_sampling_result. Статусы: pending/in_progress/completed/failed.</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСэмпла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗапросПолезнаяНагрузка</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтветПолезнаяНагрузка</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяОбновления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОшибкаТекст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/LN_МСРСэмплинг/Ext/Module.bsl
//LN++ Общий модуль LN_МСРСэмплинг
//
// MCP sampling/createMessage в условиях синхронного HTTP-транспорта.
// Прямой call-back от сервера к клиенту невозможен — поэтому работает очередь:
//
//   1) Любой server-side код (tool / prompt / роутер JSON-RPC) вызывает
//      LN_МСРСэмплинг.СоздатьЗапрос(Полезное) — возвращает sample_id (UUID-без-дефисов).
//   2) Клиент-агент периодически опрашивает tool pull_pending_sampling и забирает
//      готовый pending-запрос (переходит в in_progress).
//   3) Клиент-агент выполняет LLM-вызов локально и присылает результат через
//      submit_sampling_result(sample_id, content) — переход в completed/failed.
//   4) Любой код может опросить get_sampling_result(sample_id, wait_ms) и забрать
//      готовое содержимое.
//
// Для прямого вызова из MCP-метода sampling/createMessage (POST /mcp с method="sampling/createMessage")
// используйте ЗапроситьСэмплингИзРПКПротокола(Параметры) — она просто оборачивает СоздатьЗапрос.

#Область ПрограммныйИнтерфейс

// Создаёт pending-запрос на сэмплинг.
// Полезное — структура с полями MCP-спецификации (messages, modelPreferences, systemPrompt, ...).
// Возвращает sample_id.
Функция СоздатьЗапрос(Полезное) Экспорт

	Идентификатор = СтрЗаменить(Строка(Новый УникальныйИдентификатор), "-", "");
	ЗаписатьЗапись(Идентификатор, "pending", Полезное, Неопределено, "");
	Возврат Идентификатор;

КонецФункции

// Используется напрямую из mcp_APIBackend для метода sampling/createMessage.
// Возвращает структуру { sample_id, status, hint } — это extension к спецификации,
// клиент-агент должен далее опрашивать get_sampling_result / pull_pending_sampling.
Функция ЗапроситьСэмплингИзРПКПротокола(Параметры) Экспорт

	Идентификатор = СоздатьЗапрос(Параметры);
	Возврат Новый Структура("sample_id, status, hint",
		Идентификатор, "pending",
		"Сервер запросил сэмплинг. Клиент должен опросить tool pull_pending_sampling,"
			+ " выполнить LLM-вызов и вернуть submit_sampling_result(sample_id, content).");

КонецФункции

// Забирает первый pending-запрос (FIFO) и переводит его в in_progress.
// Используется tool pull_pending_sampling.
Функция ЗабратьСледующий() Экспорт

	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Очередь.ИдентификаторСэмпла КАК Идентификатор,
	|	Очередь.ЗапросПолезнаяНагрузка КАК Полезное,
	|	Очередь.ВремяСоздания КАК ВремяСоздания
	|ИЗ
	|	РегистрСведений.LN_МСРОчередьСэмплинга КАК Очередь
	|ГДЕ
	|	Очередь.Статус = ""pending""
	|УПОРЯДОЧИТЬ ПО
	|	Очередь.ВремяСоздания");
	Выборка = Запрос.Выполнить().Выбрать();
	Если Не Выборка.Следующий() Тогда
		УстановитьПривилегированныйРежим(Ложь);
		Возврат Неопределено;
	КонецЕсли;
	Полезное = Выборка.Полезное.Получить();
	УстановитьПривилегированныйРежим(Ложь);
	ЗаписатьЗапись(Выборка.Идентификатор, "in_progress", Полезное, Неопределено, "");
	Возврат Новый Структура("sample_id, payload, created_at",
		Выборка.Идентификатор, Полезное, Выборка.ВремяСоздания);

КонецФункции

// Завершает запрос — completed/failed.
Процедура ЗавершитьЗапрос(Идентификатор, Содержимое, Ошибка = "") Экспорт

	ТекущаяЗапись = ПрочитатьЗапись(Идентификатор);
	Если ТекущаяЗапись = Неопределено Тогда
		ВызватьИсключение СтрШаблон("sample_id %1 не найден", Идентификатор);
	КонецЕсли;
	НовыйСтатус = ?(ЗначениеЗаполнено(Ошибка), "failed", "completed");
	ЗаписатьЗапись(Идентификатор, НовыйСтатус, ТекущаяЗапись.payload, Содержимое, Ошибка);

КонецПроцедуры

// Читает текущее состояние запроса.
Функция Прочитать(Идентификатор) Экспорт
	Возврат ПрочитатьЗапись(Идентификатор);
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаписатьЗапись(Идентификатор, Статус, Полезное, Содержимое, Ошибка)
	УстановитьПривилегированныйРежим(Истина);
	НаборЗаписей = РегистрыСведений.LN_МСРОчередьСэмплинга.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ИдентификаторСэмпла.Установить(Идентификатор);
	Запись = НаборЗаписей.Добавить();
	Запись.ИдентификаторСэмпла = Идентификатор;
	Запись.Статус = Статус;
	Если Полезное <> Неопределено Тогда
		Запись.ЗапросПолезнаяНагрузка = Новый ХранилищеЗначения(Полезное);
	КонецЕсли;
	Если Содержимое <> Неопределено Тогда
		Запись.ОтветПолезнаяНагрузка = Новый ХранилищеЗначения(Содержимое);
	КонецЕсли;
	Если Статус = "pending" Тогда
		Запись.ВремяСоздания = ТекущаяДатаСеанса();
	Иначе
		Существующая = ПрочитатьЗапись(Идентификатор);
		УстановитьПривилегированныйРежим(Истина);
		Запись.ВремяСоздания = ?(Существующая = Неопределено, ТекущаяДатаСеанса(), Существующая.created_at);
	КонецЕсли;
	Запись.ВремяОбновления = ТекущаяДатаСеанса();
	Запись.ОшибкаТекст = Ошибка;
	НаборЗаписей.Записать();
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры

Функция ПрочитатьЗапись(Идентификатор)
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Очередь.Статус КАК Статус,
	|	Очередь.ЗапросПолезнаяНагрузка КАК Полезное,
	|	Очередь.ОтветПолезнаяНагрузка КАК Содержимое,
	|	Очередь.ВремяСоздания КАК created_at,
	|	Очередь.ВремяОбновления КАК updated_at,
	|	Очередь.ОшибкаТекст КАК ОшибкаТекст
	|ИЗ
	|	РегистрСведений.LN_МСРОчередьСэмплинга КАК Очередь
	|ГДЕ
	|	Очередь.ИдентификаторСэмпла = &Идентификатор");
	Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Не Выборка.Следующий() Тогда
		УстановитьПривилегированныйРежим(Ложь);
		Возврат Неопределено;
	КонецЕсли;
	Результат = Новый Структура(
		"sample_id, status, payload, content, error, created_at, updated_at",
		Идентификатор, Выборка.Статус,
		?(ТипЗнч(Выборка.Полезное) = Тип("ХранилищеЗначения"), Выборка.Полезное.Получить(), Неопределено),
		?(ТипЗнч(Выборка.Содержимое) = Тип("ХранилищеЗначения"), Выборка.Содержимое.Получить(), Неопределено),
		Выборка.ОшибкаТекст, Выборка.created_at, Выборка.updated_at);
	УстановитьПривилегированныйРежим(Ложь);
	Возврат Результат;
КонецФункции

#КонецОбласти
